app/views/home/index.html.erb

				<div class="col-lg-3 col-md-6 col-sm-6" id="imageGrid1">
					<% rnd_img = Paint.where(:image => "paints/pastor.PNG") %>
---
SELECT "paints".* FROM "paints" WHERE "paints"."image" = ?  [["image", "paints/pastor.PNG"]]

						<div class="col-lg-6 col-md-12 col-sm-12">
							<% rnd_img = Paint.find(rand(1..Paint.count)) %>
---
SELECT  "paints".* FROM "paints" WHERE "paints"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]